Cisco - Konfigurasi Dynamic Routing BGP (Border Gateway Protocol
EGP (Eksterior Gateway Protokol)

- Siapkan Device
3 Router (PT-Router)
3 Switch (Switch 2960)
3 PC

- Hubungkan Router 1 ke Router 2 dengan Kabel Automatic (Serial) (Se2/0 - Se2/0)
- Hubungkan Router 2 ke Router 3 dengan Kabel Automatic (Serial) (Se3/0 - Se2/0)
- Hubungkan Router 3 ke Router 1 dengan Kabel Automatic (Serial) (Se3/0 - Se3/0)

- Hubungkan Router 1 dengan Switch dan PC 1 dengan kabel automatic (Fa0/1)(Fa0/2)
- Hubungkan Router 2 dengan Switch dan PC 2 dengan kabel automatic (Fa0/1)(Fa0/2)
- Hubungkan Router 3 dengan Switch dan PC 3 dengan kabel automatic (Fa0/1)(Fa0/2)

Router 1 Indosat = No As(Autonomous System). 100
Router 2 Telkomsel = No As(Autonomous System). 300
Router 3 XL = No As(Autonomous System). 200

- Konfigurasi PC 1
Klik PC 1 -> Dekstop -> Static
192.168.10.2
255.255.255.0
192.168.10.1

- Konfigurasi PC 2
Klik PC 1 -> Dekstop -> Static
192.168.30.2
255.255.255.0
192.168.30.1

- Konfigurasi PC 3
Klik PC 1 -> Dekstop -> Static
192.168.20.2
255.255.255.0
192.168.20.1

- Konfigurasi Router 1 Indosat
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.10.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 10.10.10.1 255.255.255.252
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#ex
Router(config)#int se3/0
Router(config-if)#ip add 20.20.20.1 255.255.255.252
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial3/0, changed state to down
Router(config-if)#


- Konfigurasi Router 3 XL
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.20.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 30.30.30.1 255.255.255.252
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#ex
Router(config)#int se3/0
Router(config-if)#ip add 20.20.20.2 255.255.255.252
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial3/0, changed state to up

Router(config-if)#ex
Router(config)#

- Konfigurasi Router 2 Telkomsel
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.30.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se3/0
Router(config-if)#ip add 30.30.30.2 255.255.255.252
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial3/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 10.10.10.2 255.255.255.252
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up


- Konfigurasi BGP pada Router 1 Indosat
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 100
Router(config-router)#neighbor 10.10.10.2 remote-as 300
Router(config-router)#neighbor 20.20.20.2 remote-as 200
Router(config-router)#network 10.10.10.0 mask 255.255.255.252
Router(config-router)#network 20.20.20.0 mask 255.255.255.252
Router(config-router)#network 192.168.10.0 mask 255.255.255.0
Router(config-router)#


- Konfigurasi BGP pada Router 3 XL
Router>en
Router#conf term
Router(config)#router bgp 200
Router(config-router)#neighbor 20.20.20.1 remote-as 100
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 20.20.20.1 Up
Router(config-router)#neighbor 30.30.30.2 remote-as 300
Router(config-router)#network 20.20.20.0 mask 255.255.255.252
Router(config-router)#network 30.30.30.0 mask 255.255.255.252
Router(config-router)#network 192.168.20.0 mask 255.255.255.0
Router(config-router)#

- Konfigurasi BGP pada Router 2 Telkomsel
Router>en
Router#conf term
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 300
Router(config-router)#neighbor 10.10.10.1 remote-as 100
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 10.10.10.1 Up

Router(config-router)#neighbor 30.30.30.1 remote-as 200
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 30.30.30.1 Up

Router(config-router)#network 30.30.30.0 mask 255.255.255.252
Router(config-router)#network 10.10.10.0 mask 255.255.255.252
Router(config-router)#network 192.168.30.0 mask 255.255.255.0
Router(config-router)#ex

- Cek Routing table pada semua router
Router#sh ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/30 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, Serial2/0
     20.0.0.0/30 is subnetted, 1 subnets
B       20.20.20.0 [20/0] via 10.10.10.1, 00:00:00
     30.0.0.0/30 is subnetted, 1 subnets
C       30.30.30.0 is directly connected, Serial3/0
B    192.168.10.0/24 [20/0] via 10.10.10.1, 00:00:00
B    192.168.20.0/24 [20/0] via 30.30.30.1, 00:00:00
C    192.168.30.0/24 is directly connected, FastEthernet0/0

Router#


- Cek Ping pada semua Perangkat


