Konfigurasi Dynamic Routing OSPF Multi Area

- Siapkan Device:

4 Router PT
4 PC

- Hubungkan semua perangkat menggunakan kabel automatic

- Konfigurasi PC 1
10.10.10.2
255.0.0.0
10.10.10.1

- Konfigurasi PC 2
20.20.20.2
255.0.0.0
20.20.20.1

- Konfigurasi PC 3
30.30.30.2
255.0.0.0
30.30.30.1

- Konfigurasi PC 4
40.40.40.2
255.0.0.0
40.40.40.1

- Konfigurasi Router 1
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 10.10.10.1 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 11.11.11.1 255.0.0.0
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#
Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

- Konfigurasi Router 2
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 20.20.20.1 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 11.11.11.2 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#ex
Router(config)#int se3/0
Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

Router(config-if)#ip add 22.22.22.1 255.0.0.0
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial3/0, changed state to down
Router(config-if)#
Router(config-if)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

- Konfigurasi Router 3
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 30.30.30.1 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#
Router(config)#int se2/0
Router(config-if)#ip add 22.22.22.2 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#ex
Router(config)#int se3/0
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

Router(config-if)#ip add 33.33.33.1 255.0.0.0
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial3/0, changed state to down
Router(config-if)#
Router(config-if)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

- Konfigurasi Router 4
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#int fa0/0
Router(config-if)#ip add 40.40.40.1 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 33.33.33.2 255.0.0.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

- Konfigurasi OSPF Multi Area Router 1
Router(config-if)#ex
Router(config)#router ospf 1
Router(config-router)#router-id 1.1.1.1
Router(config-router)#network 10.10.10.0 0.0.0.255 area 1
Router(config-router)#network 11.11.11.0 0.0.0.255 area 1

- Konfigurasi OSPF Multi Area Router 2
Router(config)#router ospf 2
Router(config-router)#router-id 2.2.2.2
Router(config-router)#network 20.20.20.0 0.0.0.255 area 1
Router(config-router)#network 22.22.22.0 0.0.0.255 area 0
Router(config-router)#network 11.11.11.0 0.0.0.255 area 1
Router(config-router)#
00:18:15: %OSPF-5-ADJCHG: Process 2, Nbr 1.1.1.1 on Serial2/0 from LOADING to FULL, Loading Done

Router(config-router)#
Router(config-router)#
00:19:58: %OSPF-5-ADJCHG: Process 2, Nbr 3.3.3.3 on Serial3/0 from LOADING to FULL, Loading Done

- Konfigurasi OSPF Multi Area Router 3
Router(config)#router ospf 3
Router(config-router)#router-id 3.3.3.3
Router(config-router)#network 30.30.30.0 0.0.0.255 area 0
Router(config-router)#network 22.22.22.0 0.0.0.255 area 0
Router(config-router)#
00:19:56: %OSPF-5-ADJCHG: Process 3, Nbr 2.2.2.2 on Serial2/0 from LOADING to FULL, Loading Done

Router(config-router)#network 33.33.33.0 0.0.0.255 area 2
Router(config-router)#
00:22:28: %OSPF-5-ADJCHG: Process 3, Nbr 4.4.4.4 on Serial3/0 from LOADING to FULL, Loading Done

- Konfigurasi OSPF Multi Area Router 4
Router(config)#router ospf 4
Router(config-router)#router-id 4.4.4.4
Router(config-router)#network 40.40.40.0 0.0.0.255 area 2
Router(config-router)#network 33.33.33.0 0.0.0.255 area 2
Router(config-router)#
00:22:27: %OSPF-5-ADJCHG: Process 4, Nbr 3.3.3.3 on Serial2/0 from LOADING to FULL, Loading Done

Router(config-router)#
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#w
Building configuration...
[OK]
Router#sh ip ospf ne
Router#sh ip ospf neighbor 


Neighbor ID     Pri   State           Dead Time   Address         Interface
3.3.3.3           0   FULL/  -        00:00:39    33.33.33.1      Serial2/0
Router#sh ip ospf da
Router#sh ip ospf database 
            OSPF Router with ID (4.4.4.4) (Process ID 4)

                Router Link States (Area 2)

Link ID         ADV Router      Age         Seq#       Checksum Link count
4.4.4.4         4.4.4.4         16          0x80000003 0x003d9b 3
3.3.3.3         3.3.3.3         16          0x80000002 0x0017ff 2

                Summary Net Link States (Area 2)
Link ID         ADV Router      Age         Seq#       Checksum
30.0.0.0        3.3.3.3         111         0x80000001 0x00b182
22.0.0.0        3.3.3.3         111         0x80000002 0x00916a
20.0.0.0        3.3.3.3         111         0x80000003 0x00b348
11.0.0.0        3.3.3.3         111         0x80000004 0x009e26
10.0.0.0        3.3.3.3         111         0x80000005 0x00b310
Router#


- Cek Ping Antar Device


