Cisco | Konfigurasi Access List Standard dan Extended

- Siapkan device
1 Server
2 Router PT- Router
2 Switch PT- Switch
4 PC

- Hubungkan Router 1 dan Router 2 dengan kabel automatic (Se2/0 - Se2/0)
- Hubungkan Router 1 dan Switch 1 dengan kabel automatic (Fa0/0 - Fa0/1)
- Hubungkan Router 2 dan Switch 2 dengan kabel automatic (Fa0/0 - Fa0/1)

- Hubungkan PC 1 dan Switch 1 dengan kabel automatic (Fa0/2 - Fa0)
- Hubungkan PC 2 dan Switch 1 dengan kabel automatic (Fa0/3 - Fa0)

- Hubungkan PC 1 dan Switch 2 dengan kabel automatic (Fa0/2 - Fa0)
- Hubungkan PC 2 dan Switch 2 dengan kabel automatic (Fa0/3 - Fa0)

- Konfigurasi Router 1 (Ip Int, DHCP Server, EIGRP:10)
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname Router-A
Router-A(config)#int fa0/0
Router-A(config-if)#ip add 172.16.1.1 255.255.255.0
Router-A(config-if)#no sh

Router-A(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router-A(config-if)#exit
Router-A(config)#int se2/0
Router-A(config-if)#clock rate 64000
Router-A(config-if)#ip add 1.1.1.1 255.255.255.252
Router-A(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router-A(config-if)#exit
Router-A(config)#ip dhcp pool DHCP-R-A
Router-A(dhcp-config)#default 172.16.1.1
Router-A(dhcp-config)#network 172.16.1.0 255.255.255.0
Router-A(dhcp-config)#dns 8.8.8.8
Router-A(dhcp-config)#exit
Router-A(config)#
Router-A(config)#router eigrp 10
Router-A(config-router)#network 1.1.1.0
Router-A(config-router)#network 172.16.1.0
Router-A(config-router)#

- Konfigurasi Router 2(IP Int, DHCP Server, EIGRP:10)
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host Router-B
Router-B(config)#int fa0/0
Router-B(config-if)#ip add 192.168.1.1 255.255.255.0
Router-B(config-if)#no sh

Router-B(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router-B(config-if)#int se2/0
Router-B(config-if)#ip add 1.1.1.2 255.255.255.252
Router-B(config-if)#no sh

Router-B(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router-B(config-if)#ex
Router-B(config)#ip dhcp pool
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

% Incomplete command.
Router-B(config)#no ip dhcp pool 
% Incomplete command.
Router-B(config)#ip dhcp pool DHCP-R-B
Router-B(dhcp-config)#default 192.168.1.1
Router-B(dhcp-config)#network 192.168.1.0 255.255.255.0
Router-B(dhcp-config)#dns 8.8.8.8
Router-B(dhcp-config)#ex
Router-B(config)#router eigrp 10
Router-B(config-router)#network 192.168.1.0
Router-B(config-router)#network 1.1.1.0
Router-B(config-router)#
%DUAL-5-NBRCHANGE: IP-EIGRP 10: Neighbor 1.1.1.1 (Serial2/0) is up: new adjacency

Router-B(config-router)#
Router-B(config-router)#%DHCPD-4-PING_CONFLICT: DHCP address conflict:  server pinged 192.168.1.1.

Router-B(config-router)#

- Konfigurasi PC 1
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 2
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 3
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 4
Klik PC -> Desktop -> IP Configuration -> DHCP


- Konfigurasi Standard Access List Pada Router 2 (Deny PC 2 Outbond)
Router-B(config)#access-list ?
  <1-99>     IP standard access list
  <100-199>  IP extended access list
Router-B(config)#access-list 1 deny 172.16.1.3
Router-B(config)#access-list 1 permit any
Router-B(config)#int fa0/0
Router-B(config-if)#ip access-group 1 out
Router-B(config-if)# 

#Test Ping ke 192.168.1.2 (Unreachable) Menggunakan PC 2 

#Hapus AccessList 1
Router-B#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router-B(config)#do sh acc
Standard IP access list 1
    10 deny host 172.16.1.3 (4 match(es))
    20 permit any (6 match(es))

Router-B(config)#no access-list 1
Router-B(config)#

- Konfigurasi Standard Access List Pada Router 2 (Deny PC 2 Inbond)
Router-B(config)#access-list 2 deny 172.16.1.3
Router-B(config)#access-list 2 permit any
Router-B(config)#int se2/0
Router-B(config-if)#ip access-group 2 in
Router-B(config-if)#

#Test Ping ke 1.1.1.2 (Unreachable) Menggunakan PC 2 
#Hapus Access List 2
Router-B(config)#do sh acc
Standard IP access list 2
    10 deny host 172.16.1.3 (2 match(es))
    20 permit any (63 match(es))

Router-B(config)#no access-list 2
Router-B(config)#

- Konfigurasi Standard Access List Pada Router 2 (Deny Area A 172.16.1.0 Inbond)
Router-B(config)#access-list 2 deny 172.16.1.0
Router-B(config)#int se2/0
%DUAL-5-NBRCHANGE: IP-EIGRP 10: Neighbor 1.1.1.1 (Serial2/0) is down: holding time expired

Router-B(config-if)#ip access-group 2 in
Router-B(config-if)#

#Hapus Access List 2
Router-B(config)#no access-list 2
Router-B(config)#

Extended Access List
- Tambahkan 1 Server dan Hubungkan dengan Router2 Menggunakan Kabel Automatic (Fa0 - Fa1/0)
- Konfigurasi Server
Klik Server -> Desktop -> IP Configuration ->Static
5.5.5.1
255.255.255.252
5.5.5.2

- Konfigurasi Routing dan DNS Extended Access List pada Router 2
Router-B#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router-B(config)#int fa1/0
Router-B(config-if)#ip add 5.5.5.2 255.255.255.252
Router-B(config-if)#no sh

Router-B(config-if)#exit
Router-B(config)#router eigrp 10
Router-B(config-router)#network 5.5.5.0
Router-B(config-router)#ex
Router-B(config)#

- Samakan DNS Router B dengan server
Router-B(config)#do sh run | include dhcp
ip dhcp pool DHCP-R-B
Router-B(config)#ip dhcp pool DHCP-R-B
Router-B(dhcp-config)#dns 5.5.5.1
Router-B(dhcp-config)#

- Samakan DNS Router A dengan server
Router-A>en
Router-A#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router-A(config)#ip dhcp pool DHCP-R-A
Router-A(dhcp-config)#dns 5.5.5.1
Router-A(dhcp-config)#ex
Router-A(config)#end
Router-A#
%SYS-5-CONFIG_I: Configured from console by console
Router-A#

- Konfigurasi PC 1
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 2
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 3
Klik PC -> Desktop -> IP Configuration -> DHCP
- Konfigurasi PC 4
Klik PC -> Desktop -> IP Configuration -> DHCP

- Aktifkan DNS Server pada Server
Klik Server -> Service -> DNS -> on
name = rizuki.id
address = 5.5.5.1
add

#Block PC 1 (Bisa Ping Tapi Tidak bisa akses web server dari browser) dengan extended Access List

- Konfigurasi Access List Extended Router 2
Router-B>en
Router-B#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router-B(config)#do sh acc
Router-B(config)#access-list 100 deny tcp host 172.16.1.2 host 5.5.5.1 eq 80
Router-B(config)#access-list 100 permit ip any any
Router-B(config)#int fa1/0
Router-B(config-if)#ip access-group 100 out
Router-B(config-if)#ex
Router-B(config)#

#Test Ping ke Server menggunakan PC 1 dan Akses Lewat Browser
Reques Time Out





































