Cisco - Konfigurasi VLAN Trunk

- Siapkan Device
2 Switch (Switch2950-24)
7 PC (client)


- Hubungkan PC 1 ke Switch 1 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/1)
- Hubungkan PC 2 ke Switch 1 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/2)
- Hubungkan PC 3 ke Switch 1 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/3)

- Hubungkan PC 4 ke Switch 2 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/1)
- Hubungkan PC 4 ke Switch 2 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/2)
- Hubungkan PC 4 ke Switch 2 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/3)
- Hubungkan PC 4 ke Switch 2 dengan Kabel Straight (FastEthernet0 / FastEthernet 0/4)

- Hubungkan Switch 1 ke Switch 2 dengan Kabel Cross (FastEthernet0/24 / FastEthernet 0/24)

- Konfigurasi PC 1
Klik PC 1 -> Dekstop -> Static
192.168.0.1
255.255.255.0

- Konfigurasi PC 2
Klik PC 1 -> Dekstop -> Static
192.168.0.2
255.255.255.0

- Konfigurasi PC 3
Klik PC 1 -> Dekstop -> Static
192.168.0.3
255.255.255.0

- Konfigurasi PC 4
Klik PC 1 -> Dekstop -> Static
192.168.0.4
255.255.255.0

- Konfigurasi PC 5
Klik PC 1 -> Dekstop -> Static
192.168.0.5
255.255.255.0

- Konfigurasi PC 6
Klik PC 1 -> Dekstop -> Static
192.168.0.6
255.255.255.0

- Konfigurasi PC 7
Klik PC 1 -> Dekstop -> Static
192.168.0.7
255.255.255.0

- Konfigurasi Vlan Trunk pada Switch 1
Switch>
Switch>en
Switch#conf term
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname Switch1
Switch1(config)#vlan 10
Switch1(config-vlan)#name admin
Switch1(config-vlan)#ex
Switch1(config)#vlan 20
Switch1(config-vlan)#name finance
Switch1(config-vlan)#ex
Switch1(config)#ex
Switch1#
%SYS-5-CONFIG_I: Configured from console by console

Switch1#sh vlan

Switch1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1(config)#interface fa0/1
	
Switch1(config-if)#switchport mode access
Switch1(config-if)#switchport access vlan 10
Switch1(config-if)#interface fa0/2
Switch1(config-if)#switchport access vlan 10
Switch1(config-if)#interface fa0/3
Switch1(config-if)#switchport access vlan 20
Switch1(config-if)#ex
Switch1(config)#int fa0/24
Switch1(config-if)#switchport mode access
Switch1(config-if)#switchport mode trunk

Switch1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up

Switch1(config-if)#ex
Switch1#sh vlan


- Konfigurasi Vlan Trunk pada Switch 2
Switch2>EN
Switch2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch2(config)#vlan 10
Switch2(config-vlan)#name admin
Switch2(config-vlan)#ex
Switch2(config)#vlan 20
Switch2(config-vlan)#name finance
Switch2(config-vlan)#ex
Switch2(config)#ex
Switch2#
%SYS-5-CONFIG_I: Configured from console by console

Switch2#sh vlan

Switch2(config)#interface fa0/1
Switch2(config-if)#switchport mode access
Switch2(config-if)#switchport access vlan 20
Switch2(config-if)#interface fa0/2
Switch2(config-if)#switchport mode access
Switch2(config-if)#switchport access vlan 20
Switch2(config-if)#interface fa0/3
Switch2(config-if)#switchport mode access
Switch2(config-if)#switchport access vlan 10
Switch2(config-if)#interface fa0/4
Switch2(config-if)#switchport mode access
Switch2(config-if)#switchport access vlan 10
Switch2(config-if)#ex
Switch2(config)#ex
Switch2#
%SYS-5-CONFIG_I: Configured from console by console


Switch2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch2(config)#interface fa0/24
Switch2(config-if)#switchport mode access
Switch2(config-if)#switchport mode trunk
Switch2#sh vlan

- Test Ping antar Vlan yang berbeda switch









