Packet tracert 
1. Buat jaringan peer to peer 
2. Buat jaringan komputer dengan 4 pc
Virtual box
3. Beri Full akses terhadap file public di linux
4. Konfigurasi ip di linux
5. Tes Firewall + di Packet tracert
6. Membuat voip vlan dan routing


- Konfigurasi Vlan di CLI

Switch>en
Switch#show vlan
Switch#conf t
Switch(config)#vlan ?
Switch(config)#vlan 10
Switch(config-vlan)#name koneksi1
Switch(config-vlan)#ex
Switch(config)#vlan 20
Switch(config-vlan)#name koneksi2
Switch(config-vlan)#ex
Switch(config)#ex
Switch#show vlan

- Mendaftarkan port ke vlan
Switch#conf t
Switch(config)#interface fa0/1
Switch(config-if)#swicthport mode access
Switch(config-if)#switchport access vlan 10
Switch(config-if)#ex
Switch(config)#interface fa0/2
Switch(config-if)#swicthport mode access
Switch(config-if)#switchport access vlan 10
Switch(config-if)#ex
Switch(config)#ex
Switch#show vlan

Switch#conf t
Switch(config)#interface fa0/3
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20
Switch(config-if)#ex
Switch(config)#interface fa 0/4
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20
Switch(config-if)#ex
Switch(config)#ex
Switch(config)#show vlan
  
-Konfigurasi routing static
Contoh konfigurasi router 0
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fa0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#exit
Router(config)#interface se2/0
Router(config-if)#ip address 172.16.10.1 255.255.255.252
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fa0/0 
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface se2/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

=========================================================================================

Contoh konfigurasi router 1
Router>en
Router# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fa0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)# no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface serial2/0
Router(config-if)#ip address 172.16.10.2 255.255.255.252
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#

========================================================================
Selanjutnya lakukan routing agar saling terhubung
Router 0
Router(config-if)#exit
Router(config)#ip route 192.168.2.0 255.255.255.0 172.16.10.2
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#

Router 1
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 192.168.1.0 255.255.255.0 172.16.10.1
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#