Redistribute OSPF + BGP

- Siapkan Device
3 Router
3 Switch
1 Server
6 PC 

- Hubungkan semua device menggunakan kabel automatic

- Konfigurasi Router 1
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa4/0
Router(config-if)#ip add 192.168.40.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet4/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet4/0, changed state to up

Router(config-if)#int se2/0	
Router(config-if)#ip add 192.168.50.1 255.255.255.0
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

Router(config-if)#
Router(config-if)#ex
Router(config)#router ospf 1
Router(config-router)#network 192.168.40.0 0.0.0.255 area 0
Router(config-router)#network 192.168.50.0 0.0.0.255 area 0
Router(config-router)#
00:19:29: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.60.2 on Serial2/0 from LOADING to FULL, Loading Done


- Konfigurasi Router 2
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.30.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#int se2/0
Router(config-if)#ip add 192.168.50.2 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#ex	
Router(config)#int se3/0
Router(config-if)#ip add 192.168.60.2 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial3/0, changed state to up

Router(config-if)#
Router(config-if)#
Router(config-if)#ex
Router(config)#router ospf 1
Router(config-router)#network 192.168.30.0 0.0.0.255 area 0
Router(config-router)#network 192.168.50.0 0.0.0.255 area 0
Router(config-router)#
00:19:26: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.50.1 on Serial2/0 from LOADING to FULL, Loading Done

Router(config-router)#
Router(config-router)#ex
Router(config)#router bgp 200
Router(config-router)#neighbor 192.168.60.1 remote-as 300
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 192.168.60.1 Up	
Router(config-router)#network 192.168.60.0 mask 255.255.255.0
Router(config-router)#ex
Router(config)#

Router(config)#router bgp 200
Router(config-router)#redistribute ospf 1
Router(config-router)#ex
Router(config)#router ospf 1
Router(config-router)#redistribute bgp 200 subnets 
Router(config-router)#
Router(config-router)#ex
Router(config)#


- Konfigurasi Router 3
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.10.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#int fa1/0
Router(config-if)#ip add 192.168.20.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up

Router(config-if)#ex
Router(config)#int se2/0
Router(config-if)#ip add 192.168.60.1 255.255.255.0
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial2/0, changed state to down
Router(config-if)#ex
Router(config)#router bgp 300
Router(config-router)#neighbor 192.168.60.2 remote-as 200
Router(config-router)#network 192.168.10.0 mask 255.255.255.0
Router(config-router)#network 192.168.20.0 mask 255.255.255.0
Router(config-router)#network 192.168.60.0 mask 255.255.255.0
Router(config-router)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 192.168.60.2 Up



- Konfigurasi Server
192.168.10.2
255.255.255.0
192.168.10.1
- Konfigurasi PC .20
192.168.20.2
255.255.255.0
192.168.20.1

192.168.20.3
255.255.255.0
192.168.20.1

- Konfigurasi PC .30
192.168.30.2
255.255.255.0
192.168.30.1

192.168.30.3
255.255.255.0
192.168.30.1

- Konfigurasi PC .40
192.168.40.2
255.255.255.0
192.168.40.1

192.168.40.3
255.255.255.0
192.168.40.1












